/**
 * 課題 : スクラムとは何かを説明するモデル
 *
 * ITのモデリングはソリューションありき＝＞　ユースケースからモデリングしても良い？
 *
 * スクラムとはチームの状態、プロジェクトの状態を可視化するためのFW
 *
 * 透明性と検査と適応
 *
 * 透明性
 * 　　生産する（した）価値 = PBL
 * 　　
 *     今週生産する価値 = SBL
 *
 * 　　タスクの進捗状況 = SBL,Task
 *
 * 　　チームに存在する課題 = ImpedimentList
 *
 * 検査
 * 　　価値が生産されたかチェックするイベント = SpringReview
 * 　　
 * 　　チームに異常がないかチェックするイベント = DailyStandupMeeting
 *
 * 　　スプリントの過ごし方に異常がないかチェックするイベント = Retrospective
 *
 * 　　スプリントによって生産された価値を検査する人 = ProductOwner
 *
 *     チームのスプリントの過ごし方を検査する人 = ScrumMaster
 *
 * 適応
 *
 *
 * 　　
 *
 */
package scrum;